In [1]:
import pandas as pd
archivo = "C:/Users/HP/Desktop/pandas/Titanic.csv"
df = pd.read_csv(archivo)

In [3]:
# informacion sobre el dataframe 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
# tupla con el numero de filas y columnas 
df.shape

(891, 12)

In [5]:
# numero de elementos (filas * columnas)
df.size

10692

In [6]:
# nombre de las columnas
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
#nombres de ,os indices 
df.index

RangeIndex(start=0, stop=891, step=1)

In [8]:
#tipo de datos de las columnas
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [9]:
#primeras 5 filas 
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
# ultimos datos 
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [11]:

#accediendo a un elemento 
print(df.loc[2,"Name"])

Heikkinen, Miss. Laina

In [27]:
#renombrando (indices) y nombre de las columnas

dfE = df.rename(columns={'PassengerId':'idpasajero', 'Survived':'sobrevivio', 'Pclass':'clase', 'Name':'nombre', 'Sex':'sexo', 'Age':'edad', 'SibSp':'numhermanos',
       'Parch':'numpadresehijos', 'Ticket':'iddelbillete', 'Fare':'preciobillete', 'Cabin':'idcamarote', 'Embarked':'puertoembarcacion'})

In [28]:
dfE.head(3)

,idpasajero,sobrevivio,clase,nombre,sexo,edad,numhermanos,numpadresehijos,iddelbillete,preciobillete,idcamarote,puertoembarcacion
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [29]:
# df.reindex reorganiza

In [30]:
#acceder a los datos
dfE.iloc[2,2]

3

In [36]:
print(type(dfE.idpasajero))

<class 'pandas.core.series.Series'>

In [35]:
#acceso a una columna 
dfE.clase

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: clase, Length: 891, dtype: int64

In [37]:
#operacion sobre columna 
print(dfE['sobrevivio']*1 )

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: sobrevivio, Length: 891, dtype: int64

In [38]:
print(dfE['sexo'] == 'male')

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: sexo, Length: 891, dtype: bool

In [39]:
#estadisticas descriptivas 
dfE.describe()

,idpasajero,sobrevivio,clase,edad,numhermanos,numpadresehijos,preciobillete
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [42]:
# eliminar una columna
numhermanos = dfE.pop('numhermanos')
print(numhermanos)

KeyError: 'numhermanos'

In [43]:
dfE.head(3)

,idpasajero,sobrevivio,clase,nombre,sexo,edad,numpadresehijos,iddelbillete,preciobillete,idcamarote,puertoembarcacion
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S